import { useState } from "react";

type fagsArray = {
    question: string
    answer: string
}

type fagsData = {
    [key: string]: fagsArray[]
}

type cateArray = {
    id: string
    label: string
}

export default function FAQSection() {
    const [activeCategory, setActiveCategory] = useState<string>("design");
    const [openIndex, setOpenIndex] = useState<number | null>(null);

    const faqs: fagsData = {
        design: [
            {
                question: "آیا خدمات شما فقط شامل طراحی است یا اجرا را هم پوشش می‌دهد؟",
                answer: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد",
            },
            {
                question: "آیا قبل از شروع ساخت و ساز می‌توانم طرح نهایی را ببینم؟",
                answer: "قطعاً. در فاز طراحی، ما با استفاده از نرم‌افزارهای پیشرفته مدل‌سازی (مانند BIM و ابزارهای سه‌بعدی)، طرح کامل پروژه را به صورت دقیق و واقع‌گرایانه برای شما شبیه‌سازی می‌کنیم. شما می‌توانید قبل از هرگونه اقدام اجرایی، تمام جزئیات معماری، نما، دکوراسیون داخلی و حتی سیستم‌های هوشمندسازی را مشاهده و تأیید کنید. این کار به شما اطمینان می‌دهد که نتیجه نهایی دقیقاً همان چیزی است که در ذهن داشته‌اید.",
            },
            {
                question: "چه مدت زمانی برای طراحی و اخذ پروانه ساخت نیاز است؟",
                answer: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
            }
        ],
        costs: [
            {
                question: "هزینه پروژه ها به چه صورت است؟",
                answer: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
            },
            {
                question: "آیا هزینه ها باید به صورت یکجا پرداخت شود؟",
                answer: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
            },
            {
                question: "هزینه ها باتوجه به پروژه قابل تغییر است؟",
                answer: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
            },
        ],
        management: [
            {
                question: "چطور زمان‌بندی پروژه مشخص می‌شود؟",
                answer:
                    "پس از بررسی نیازها و حجم کار، برنامه زمانی دقیق توسط تیم ما تنظیم می‌شود.",
            },
            {
                question: "آیا گزارش پیشرفت پروژه ارائه می‌دهید؟",
                answer:
                    "بله، گزارش‌های هفتگی شامل وضعیت کار، هزینه‌ها و مشکلات احتمالی ارسال می‌شود.",
            },
            {
                question: "آیا ما در طول پروژه از مراحل کار مطلع می شویم؟",
                answer: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"
            }
        ],
        innovation: [
            {
                question: "چه تکنولوژی‌هایی در طراحی پروژه‌ها استفاده می‌کنید؟",
                answer:
                    "از ابزارهای BIM، طراحی پارامتریک و مدل‌سازی سه‌بعدی برای افزایش دقت و خلاقیت استفاده می‌کنیم.",
            },
            {
                question: "آیا امکان استفاده از طرح‌های سفارشی و نوآورانه وجود دارد؟",
                answer:
                    "بله، تیم ما طرح‌ها را بر اساس سبک و سلیقه‌ی خاص شما شخصی‌سازی می‌کند.",
            },
            {
                question: "آیا امکان ارائه طرح پیشنهادی وجود دارد؟",
                answer: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
            }
        ],
    };

    const categories: cateArray[] = [
        { id: "design", label: "طراحی" },
        { id: "costs", label: "هزینه و زمان بندی" },
        { id: "management", label: "اجرا و مدیریت" },
        { id: "innovation", label: "نوآوری و تخصص" },
    ];

    const toggleQuestion = (index: number) => {
        setOpenIndex(openIndex === index ? null : index);
    };

    return (
        <section className="p-8 md:p-16 text-right bg-[#fdfbf8] min-h-screen">

            {/* Button Category*/}
            <div className="button-container flex flex-wrap gap-20 mb-8 items-center justify-center">

                {categories.map((cat) => {
                    return (
                        <button key={cat.id} onClick={() => { setActiveCategory(cat.id); setOpenIndex(null); }} className={`button-question w-[190px] h-[48px] flex items-center justify-center px - 4 py-2 rounded-[8px] border-[#B85C38] border-[3px] transition text-[22px] font-medium ${activeCategory === cat.id ? "bg-[#B85C38] text-white" : "text-[#B85C38] hover:bg-[#B85C38] hover:text-white"}`}>{cat.label}</button>
                    )
                })}

            </div>

            {/* Questions */}
            <div className="image-question space-y-4 flex items-center gap-11">
                <img src="./Images/desk-8.png" className="w-[512px] h-[493px] rounded-b-[40px] rounded-tr-[40px] " />
                <div className="flex flex-col items-baseline">
                    {faqs[activeCategory].map((item, index) => (
                        <div key={index} className="bg-white border-b-[#B85C38] border-b-2 overflow-hidden transition-all">
                            <button onClick={() => { toggleQuestion(index) }} className="main-question w-full flex justify-between items-center text-right p-4">
                                <span className={`font-medium text-[22px] ${openIndex === index ? "text-[#B85C38]" : "text-[#362826]"}`}>{item.question}</span>
                            </button>

                            <div
                                className={`respons-question px-4 pb-4 text-[#362826] font-medium text-[22px] w-[706px] transition-all duration-1000 ease-in-out ${openIndex === index ? "max-h-96 opacity-100" : "max-h-0 opacity-0 "}`}>{item.answer}
                            </div>
                        </div >
                    ))
                    }
                </div>
            </div >
        </section >
    );
}