  //ارایه مراحل کارما
  import {offer,Group,hand,report,contract} from "../assets/images/services"
  export const ourWorkSteps = [
    {
      image: offer,
      title: "بازدید و ارائه طرح پیشنهادی",
      description: "تیم فنی ما از محل پروژه بازدید می‌کند و یک طرح پیشنهادی جامع شامل جزئیات فنی، زمان‌بندی و برآورد هزینه‌ها را به شما ارائه می‌دهد.",
    },
    {
      image: Group,
      title: "مشاوره و ارزیابی اولیه",
      description: "با ما تماس بگیرید یا فرم درخواست مشاوره را پر کنید. ما به‌صورت تلفنی یا حضوری با شما صحبت می‌کنیم تا نیازها و اهداف پروژه شما را به‌صورت دقیق بررسی کنیم.",
    },
    {
      image: offer,
      title: "نحوه دریافت خدمات از ما",
      description: "دریافت خدمات از لاین مهندسی ما بسیار ساده و شفاف است. ما یک فرآیند گام به گام را برای شما طراحی کرده‌ایم تا از همان ابتدا تا تحویل نهایی، در جریان کامل جزئیات باشید:",
    },
     {
      image: hand,
      title: "تامین تیم متخصص مورد نیاز",
      description: "اگر در طول پروژه، نیاز به تخصص‌های ویژه‌ای باشد که خارج از توانمندی‌های داخلی ماست، نگران نباشید.ما بهترین متخصصان را برای آن بخش از کار به شما معرفی می‌کنیم .",
    },
     {
      image: report,
      title: "اجرا و گزارش‌دهی دوره‌ای",
      description: "پروژه طبق زمان‌بندی آغاز می‌شود. در تمام مراحل اجرا، شما گزارش‌های منظم و دوره‌ای از پیشرفت کار و هزینه‌ها دریافت می‌کنید.",
    },
    {
      image:contract ,
      title: "عقد قرارداد و برنامه‌ریزی دقیق",
      description: "پس از تأیید طرح، یک قرارداد شفاف و کامل منعقد می‌شود. سپس، برنامه‌ریزی دقیق برای شروع پروژه و تخصیص منابع آغاز می‌شود.",
    },
  ];