 import step1 from "../assets/images/services/Rectangle4.png";
 export const servicesSteps = [
    {
      image: step1,
      title: "طراحی",
      description: " دردر هر مرحله، از طراحی‌های معماری که روح به فضا می‌بخشند تا مدل‌سازی دقیق و طراحی‌های خلاقانه دکوراسیون داخلی و نما که پروژه‌ها را از نظر بصری متمایز می‌کنند، ما با وسواس و تعهد کامل کار می‌کنیم. با استفاده از نرم‌افزارهای پیشرفته مدل‌سازی مانند BIM و ابزارهای سه‌بعدی، طرح‌های ما کاملاً واقع‌گرایانه و قابل مشاهده پیش از اجرای پروژه هستند تا شما با اطمینان کامل تصمیم بگیرید. ",
    },
    {
      image: step1,
      title: "اجرا",
      description: " اجرای پروژه‌ها توسط تیم متخصص و باتجربه ما با استفاده از سیستم‌های نوین ساخت و ساز، متریال‌های با کیفیت و فناوری‌های پیشرفته انجام می‌شود. پروژه طبق برنامه زمان‌بندی شروع شده و در تمام مراحل، گزارش‌های منظم و دوره‌ای از پیشرفت کار و هزینه‌ها به شما ارائه می‌شود. اگر نیاز به تخصص‌های خاصی در طول پروژه باشد، از شبکه گسترده همکاران معتبر برای تأمین تیم متخصص استفاده می‌کنیم تا پروژه بدون وقفه و با بهترین کیفیت پیش برود.",
    },
    {
      image: step1,
      title: "نظارت",
      description: "خدمات نظارت ما به صورت مقیم یا دوره‌ای ارائه می‌شود تا از اجرای دقیق پروژه مطابق نقشه‌ها و استانداردهای کیفیت اطمینان حاصل کنیم. تیم متخصص ما به طور مستمر بر کیفیت اجرا، زمان‌بندی و ایمنی پروژه نظارت دارد و در صورت بروز هرگونه مشکل یا نیاز به اصلاح، اقدامات لازم را انجام می‌دهد. هدف ما مدیریت پروژه از ابتدا تا انتهاست تا شما با خیالی آسوده پروژه‌ای موفق و بی‌نقص تحویل بگیرید",
    },
     {
      image: step1,
      title: "مشاوره",
      description: "برای شروع پروژه با ما تماس بگیرید یا فرم درخواست مشاوره را پر کنید. ما به صورت تلفنی یا حضوری با شما گفتگو می‌کنیم تا نیازها و اهداف پروژه را به دقت بررسی کنیم. تیم مشاوره ما، با ترکیب تخصص فنی و تجربه اجرا، بهترین و کامل‌ترین راهکارها را به شما ارائه می‌دهد تا تصمیمات بهینه برای سرمایه‌گذاری و طراحی اتخاذ شود و پروژه به بهترین شکل پیش برود",
    },
     {
      image: step1,
      title: "مدل‌سازی سیستم‌ها",
      description: "در فاز طراحی، با استفاده از نرم‌افزارهای پیشرفته مدل‌سازی مانند BIM و ابزارهای سه‌بعدی، طرح کامل پروژه را به صورت دقیق و واقع‌گرایانه شبیه‌سازی می‌کنیم. این فرآیند به شما امکان می‌دهد قبل از شروع اجرای پروژه، تمام جزئیات معماری، نما، دکوراسیون داخلی و سیستم‌های هوشمندسازی را مشاهده و تأیید کنید و از تطابق کامل طرح نهایی با انتظارات خود اطمینان حاصل نمایید.",
    },
  ];